BenchmarkScripts/Datasize/results/redisAggregated_3x10gb_1048576bsize.txt
Results for Redis on port 6381:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1354.97          ---          ---       112.02490       110.59100       152.57500       176.12700   1387553.88 
Gets        13546.73        37.33     13509.40         3.14952         2.79900        10.36700        18.04700      5493.04 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14901.70        37.33     13509.40        13.04342         2.92700       127.99900       151.55100   1393046.92 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.767        0.000
SET      94.207        5.000
SET      97.279       10.000
SET      99.839       15.000
SET     101.887       20.000
SET     103.423       25.000
SET     104.959       30.000
SET     106.495       35.000
SET     108.031       40.000
SET     109.567       45.000
SET     110.591       50.000
SET     111.615       52.500
SET     112.127       55.000
SET     113.151       57.500
SET     113.663       60.000
SET     114.687       62.500
SET     115.711       65.000
SET     116.223       67.500
SET     117.247       70.000
SET     118.271       72.500
SET     119.295       75.000
SET     119.807       76.250
SET     120.319       77.500
SET     121.343       78.750
SET     121.855       80.000
SET     122.367       81.250
SET     123.391       82.500
SET     123.903       83.750
SET     124.927       85.000
SET     125.439       86.250
SET     126.463       87.500
SET     126.975       88.125
SET     127.487       88.750
SET     127.999       89.375
SET     128.511       90.000
SET     129.535       90.625
SET     130.047       91.250
SET     130.559       91.875
SET     132.095       92.500
SET     133.119       93.125
SET     133.119       93.750
SET     134.143       94.062
SET     135.167       94.375
SET     135.167       94.688
SET     136.191       95.000
SET     136.191       95.312
SET     137.215       95.625
SET     138.239       95.938
SET     139.263       96.250
SET     139.263       96.562
SET     140.287       96.875
SET     141.311       97.031
SET     142.335       97.188
SET     142.335       97.344
SET     143.359       97.500
SET     143.359       97.656
SET     144.383       97.812
SET     145.407       97.969
SET     146.431       98.125
SET     146.431       98.281
SET     147.455       98.438
SET     148.479       98.516
SET     148.479       98.594
SET     149.503       98.672
SET     150.527       98.750
SET     150.527       98.828
SET     151.551       98.906
SET     152.575       98.984
SET     152.575       99.062
SET     153.599       99.141
SET     154.623       99.219
SET     154.623       99.258
SET     155.647       99.297
SET     155.647       99.336
SET     156.671       99.375
SET     156.671       99.414
SET     157.695       99.453
SET     158.719       99.492
SET     158.719       99.531
SET     159.743       99.570
SET     160.767       99.609
SET     160.767       99.629
SET     161.791       99.648
SET     162.815       99.668
SET     162.815       99.688
SET     163.839       99.707
SET     164.863       99.727
SET     165.887       99.746
SET     165.887       99.766
SET     166.911       99.785
SET     168.959       99.805
SET     168.959       99.814
SET     169.983       99.824
SET     171.007       99.834
SET     171.007       99.844
SET     172.031       99.854
SET     172.031       99.863
SET     173.055       99.873
SET     174.079       99.883
SET     176.127       99.893
SET     177.151       99.902
SET     177.151       99.907
SET     178.175       99.912
SET     179.199       99.917
SET     180.223       99.922
SET     181.247       99.927
SET     182.271       99.932
SET     183.295       99.937
SET     184.319       99.941
SET     186.367       99.946
SET     188.415       99.951
SET     189.439       99.954
SET     190.463       99.956
SET     193.535       99.958
SET     195.583       99.961
SET     197.631       99.963
SET     199.679       99.966
SET     203.775       99.968
SET     211.967       99.971
SET     216.063       99.973
SET     223.231       99.976
SET     230.399       99.977
SET     233.471       99.978
SET     235.519       99.979
SET     237.567       99.980
SET     250.879       99.982
SET     260.095       99.983
SET     268.287       99.984
SET     272.383       99.985
SET     282.623       99.987
SET     301.055       99.988
SET     307.199       99.988
SET     307.199       99.989
SET     331.775       99.990
SET     352.255       99.990
SET     360.447       99.991
SET     360.447       99.991
SET     366.591       99.992
SET     368.639       99.993
SET     378.879       99.993
SET     380.927       99.994
SET     382.975       99.994
SET     382.975       99.995
SET     385.023       99.995
SET     385.023       99.995
SET     385.023       99.995
SET     387.071       99.996
SET     387.071       99.996
SET     387.071       99.996
SET     387.071       99.997
SET     387.071       99.997
SET     387.071       99.997
[...]
SET     389.119       99.997
SET     389.119       99.998
SET     389.119       99.998
SET     389.119       99.998
[...]
SET     389.119       99.999
SET     389.119       99.999
SET     389.119       99.999
[...]
SET     391.167       99.999
SET     391.167       99.999
SET     391.167       99.999
[...]
SET     391.167      100.000
SET     391.167      100.000
SET     391.167      100.000
[...]
SET     397.311      100.000
SET     397.311      100.000
SET     397.311      100.000
[...]
SET     399.359      100.000
SET     399.359      100.000
---
GET       0.031        0.000
GET       1.455        5.000
GET       1.647       10.000
GET       1.815       15.000
GET       1.967       20.000
GET       2.127       25.000
GET       2.271       30.000
GET       2.399       35.000
GET       2.527       40.000
GET       2.671       45.000
GET       2.799       50.000
GET       2.863       52.500
GET       2.927       55.000
GET       3.007       57.500
GET       3.071       60.000
GET       3.151       62.500
GET       3.231       65.000
GET       3.311       67.500
GET       3.407       70.000
GET       3.503       72.500
GET       3.615       75.000
GET       3.679       76.250
GET       3.743       77.500
GET       3.807       78.750
GET       3.871       80.000
GET       3.951       81.250
GET       4.031       82.500
GET       4.127       83.750
GET       4.255       85.000
GET       4.351       86.250
GET       4.479       87.500
GET       4.575       88.125
GET       4.639       88.750
GET       4.735       89.375
GET       4.831       90.000
GET       4.927       90.625
GET       5.055       91.250
GET       5.183       91.875
GET       5.311       92.500
GET       5.471       93.125
GET       5.663       93.750
GET       5.759       94.062
GET       5.887       94.375
GET       5.983       94.688
GET       6.111       95.000
GET       6.239       95.312
GET       6.399       95.625
GET       6.559       95.938
GET       6.751       96.250
GET       6.943       96.562
GET       7.167       96.875
GET       7.295       97.031
GET       7.423       97.188
GET       7.583       97.344
GET       7.743       97.500
GET       7.903       97.656
GET       8.095       97.812
GET       8.319       97.969
GET       8.511       98.125
GET       8.767       98.281
GET       9.023       98.438
GET       9.151       98.516
GET       9.343       98.594
GET       9.471       98.672
GET       9.663       98.750
GET       9.855       98.828
GET      10.047       98.906
GET      10.303       98.984
GET      10.495       99.062
GET      10.815       99.141
GET      11.071       99.219
GET      11.263       99.258
GET      11.391       99.297
GET      11.583       99.336
GET      11.711       99.375
GET      11.967       99.414
GET      12.159       99.453
GET      12.415       99.492
GET      12.671       99.531
GET      12.927       99.570
GET      13.247       99.609
GET      13.439       99.629
GET      13.567       99.648
GET      13.759       99.668
GET      14.015       99.688
GET      14.207       99.707
GET      14.463       99.727
GET      14.719       99.746
GET      14.975       99.766
GET      15.231       99.785
GET      15.551       99.805
GET      15.807       99.814
GET      15.999       99.824
GET      16.191       99.834
GET      16.511       99.844
GET      16.639       99.854
GET      16.895       99.863
GET      17.151       99.873
GET      17.407       99.883
GET      17.663       99.893
GET      18.175       99.902
GET      18.303       99.907
GET      18.431       99.912
GET      18.687       99.917
GET      18.943       99.922
GET      19.199       99.927
GET      19.455       99.932
GET      19.711       99.937
GET      19.967       99.941
GET      20.223       99.946
GET      20.607       99.951
GET      20.735       99.954
GET      20.991       99.956
GET      21.247       99.958
GET      21.375       99.961
GET      21.631       99.963
GET      21.887       99.966
GET      22.143       99.968
GET      22.527       99.971
GET      22.911       99.973
GET      23.167       99.976
GET      23.551       99.977
GET      23.935       99.978
GET      24.191       99.979
GET      24.447       99.980
GET      24.831       99.982
GET      25.215       99.983
GET      25.727       99.984
GET      26.111       99.985
GET      26.623       99.987
GET      27.263       99.988
GET      27.519       99.988
GET      28.031       99.989
GET      28.287       99.990
GET      29.311       99.990
GET      30.719       99.991
GET      31.359       99.991
GET      32.639       99.992
GET      33.279       99.993
GET      34.047       99.993
GET      35.071       99.994
GET      35.327       99.994
GET      35.583       99.995
GET      36.095       99.995
GET      36.095       99.995
GET      37.119       99.995
GET      38.399       99.996
GET      41.471       99.996
GET      42.239       99.996
GET      44.031       99.997
GET      45.311       99.997
GET      46.591       99.997
GET      47.359       99.997
GET      47.871       99.997
GET      48.639       99.998
GET      49.151       99.998
GET      49.407       99.998
GET      49.663       99.998
GET      50.175       99.998
GET      50.687       99.998
GET      51.455       99.998
GET      51.967       99.999
GET      52.479       99.999
GET      52.991       99.999
GET      54.271       99.999
GET      56.319       99.999
GET      56.831       99.999
GET      57.599       99.999
GET      61.951       99.999
GET      65.279       99.999
GET      65.535       99.999
GET      66.559       99.999
GET      66.559       99.999
GET      67.071       99.999
GET      70.143       99.999
GET      72.191       99.999
GET      74.751       99.999
GET      78.847      100.000
GET      84.479      100.000
GET      84.479      100.000
GET      84.479      100.000
[...]
GET      84.991      100.000
GET      85.503      100.000
GET      86.015      100.000
GET      86.015      100.000
GET      86.015      100.000
GET      89.087      100.000
GET      90.623      100.000
GET      91.135      100.000
GET      92.671      100.000
GET      93.183      100.000
GET      93.695      100.000
GET      93.695      100.000
GET      94.207      100.000
GET      95.231      100.000
GET      95.743      100.000
GET      95.743      100.000
GET      96.767      100.000
GET      97.279      100.000
GET     103.935      100.000
GET     103.935      100.000
GET     103.935      100.000
[...]
GET     104.447      100.000
GET     104.447      100.000
GET     104.447      100.000
[...]
GET     104.959      100.000
GET     104.959      100.000
---
WAIT      0.000      100.000


Results for Redis on port 6380:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1437.60          ---          ---       106.90981       105.98300       142.33500       174.07900   1472176.16 
Gets        14373.16        40.50     14332.66         3.11526         2.75100        10.36700        18.30300      6456.95 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      15810.76        40.50     14332.66        12.55052         2.87900       120.83100       141.31100   1478633.11 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.351        0.000
SET      89.599        5.000
SET      93.695       10.000
SET      95.743       15.000
SET      97.791       20.000
SET      99.327       25.000
SET     100.863       30.000
SET     101.887       35.000
SET     103.423       40.000
SET     104.447       45.000
SET     105.983       50.000
SET     106.495       52.500
SET     107.519       55.000
SET     108.031       57.500
SET     109.055       60.000
SET     109.567       62.500
SET     110.591       65.000
SET     111.103       67.500
SET     112.127       70.000
SET     112.639       72.500
SET     113.663       75.000
SET     114.175       76.250
SET     114.687       77.500
SET     115.199       78.750
SET     115.711       80.000
SET     116.223       81.250
SET     116.735       82.500
SET     117.759       83.750
SET     118.271       85.000
SET     118.783       86.250
SET     119.807       87.500
SET     120.319       88.125
SET     120.831       88.750
SET     120.831       89.375
SET     121.343       90.000
SET     121.855       90.625
SET     122.367       91.250
SET     123.391       91.875
SET     123.903       92.500
SET     124.415       93.125
SET     125.439       93.750
SET     125.951       94.062
SET     126.463       94.375
SET     126.975       94.688
SET     127.487       95.000
SET     127.999       95.312
SET     128.511       95.625
SET     129.023       95.938
SET     130.047       96.250
SET     130.559       96.562
SET     132.095       96.875
SET     132.095       97.031
SET     132.095       97.188
SET     133.119       97.344
SET     133.119       97.500
SET     134.143       97.656
SET     135.167       97.812
SET     135.167       97.969
SET     136.191       98.125
SET     137.215       98.281
SET     137.215       98.438
SET     138.239       98.516
SET     138.239       98.594
SET     139.263       98.672
SET     139.263       98.750
SET     140.287       98.828
SET     141.311       98.906
SET     142.335       98.984
SET     143.359       99.062
SET     144.383       99.141
SET     145.407       99.219
SET     146.431       99.258
SET     146.431       99.297
SET     147.455       99.336
SET     148.479       99.375
SET     148.479       99.414
SET     149.503       99.453
SET     150.527       99.492
SET     151.551       99.531
SET     151.551       99.570
SET     153.599       99.609
SET     153.599       99.629
SET     154.623       99.648
SET     155.647       99.668
SET     156.671       99.688
SET     157.695       99.707
SET     158.719       99.727
SET     159.743       99.746
SET     160.767       99.766
SET     161.791       99.785
SET     162.815       99.805
SET     163.839       99.814
SET     163.839       99.824
SET     164.863       99.834
SET     165.887       99.844
SET     166.911       99.854
SET     167.935       99.863
SET     168.959       99.873
SET     171.007       99.883
SET     173.055       99.893
SET     175.103       99.902
SET     176.127       99.907
SET     177.151       99.912
SET     179.199       99.917
SET     182.271       99.922
SET     183.295       99.927
SET     184.319       99.932
SET     189.439       99.937
SET     193.535       99.941
SET     199.679       99.946
SET     212.991       99.951
SET     219.135       99.954
SET     231.423       99.956
SET     240.639       99.958
SET     249.855       99.961
SET     258.047       99.963
SET     428.031       99.966
SET     430.079       99.968
SET     432.127       99.971
SET     436.223       99.973
SET     436.223       99.976
SET     436.223       99.977
SET     436.223       99.978
SET     438.271       99.979
SET     438.271       99.980
SET     438.271       99.982
SET     440.319       99.983
SET     446.463       99.984
SET     798.719       99.985
SET     798.719       99.987
SET     798.719       99.988
SET     798.719       99.988
SET     798.719       99.989
SET     802.815       99.990
SET     802.815       99.990
SET     802.815       99.991
SET     802.815       99.991
SET     802.815       99.992
SET     806.911       99.993
SET     806.911       99.993
SET     806.911       99.994
SET     811.007       99.994
SET     811.007       99.995
SET     811.007       99.995
SET     811.007       99.995
SET     815.103       99.995
SET     815.103       99.996
SET     815.103       99.996
SET     815.103       99.996
SET     815.103       99.997
SET     815.103       99.997
SET     815.103       99.997
[...]
SET     815.103       99.998
SET     819.199       99.998
SET     819.199       99.998
SET     819.199       99.998
[...]
SET     819.199       99.999
SET     819.199       99.999
SET     819.199       99.999
[...]
SET     819.199      100.000
SET     823.295      100.000
SET     823.295      100.000
---
GET       0.023        0.000
GET       1.423        5.000
GET       1.615       10.000
GET       1.783       15.000
GET       1.943       20.000
GET       2.095       25.000
GET       2.223       30.000
GET       2.367       35.000
GET       2.495       40.000
GET       2.623       45.000
GET       2.751       50.000
GET       2.815       52.500
GET       2.879       55.000
GET       2.943       57.500
GET       3.023       60.000
GET       3.087       62.500
GET       3.167       65.000
GET       3.263       67.500
GET       3.343       70.000
GET       3.439       72.500
GET       3.551       75.000
GET       3.615       76.250
GET       3.679       77.500
GET       3.743       78.750
GET       3.807       80.000
GET       3.887       81.250
GET       3.967       82.500
GET       4.063       83.750
GET       4.191       85.000
GET       4.287       86.250
GET       4.447       87.500
GET       4.511       88.125
GET       4.607       88.750
GET       4.671       89.375
GET       4.799       90.000
GET       4.895       90.625
GET       5.023       91.250
GET       5.151       91.875
GET       5.279       92.500
GET       5.439       93.125
GET       5.631       93.750
GET       5.727       94.062
GET       5.855       94.375
GET       5.983       94.688
GET       6.111       95.000
GET       6.239       95.312
GET       6.399       95.625
GET       6.559       95.938
GET       6.751       96.250
GET       6.943       96.562
GET       7.167       96.875
GET       7.295       97.031
GET       7.455       97.188
GET       7.583       97.344
GET       7.743       97.500
GET       7.903       97.656
GET       8.095       97.812
GET       8.319       97.969
GET       8.511       98.125
GET       8.767       98.281
GET       9.023       98.438
GET       9.215       98.516
GET       9.343       98.594
GET       9.535       98.672
GET       9.727       98.750
GET       9.919       98.828
GET      10.111       98.906
GET      10.303       98.984
GET      10.559       99.062
GET      10.815       99.141
GET      11.135       99.219
GET      11.263       99.258
GET      11.455       99.297
GET      11.647       99.336
GET      11.839       99.375
GET      12.031       99.414
GET      12.287       99.453
GET      12.479       99.492
GET      12.735       99.531
GET      13.055       99.570
GET      13.375       99.609
GET      13.503       99.629
GET      13.695       99.648
GET      13.887       99.668
GET      14.143       99.688
GET      14.335       99.707
GET      14.591       99.727
GET      14.847       99.746
GET      15.167       99.766
GET      15.487       99.785
GET      15.807       99.805
GET      15.999       99.814
GET      16.191       99.824
GET      16.383       99.834
GET      16.639       99.844
GET      16.895       99.854
GET      17.151       99.863
GET      17.407       99.873
GET      17.791       99.883
GET      18.047       99.893
GET      18.431       99.902
GET      18.559       99.907
GET      18.815       99.912
GET      19.071       99.917
GET      19.199       99.922
GET      19.455       99.927
GET      19.711       99.932
GET      20.095       99.937
GET      20.351       99.941
GET      20.735       99.946
GET      21.119       99.951
GET      21.375       99.954
GET      21.631       99.956
GET      21.887       99.958
GET      22.143       99.961
GET      22.399       99.963
GET      22.783       99.966
GET      23.039       99.968
GET      23.679       99.971
GET      24.063       99.973
GET      24.575       99.976
GET      24.831       99.977
GET      25.087       99.978
GET      25.471       99.979
GET      25.727       99.980
GET      26.239       99.982
GET      26.751       99.983
GET      27.135       99.984
GET      27.647       99.985
GET      28.287       99.987
GET      28.799       99.988
GET      29.311       99.988
GET      29.567       99.989
GET      29.695       99.990
GET      30.079       99.990
GET      30.463       99.991
GET      31.231       99.991
GET      31.871       99.992
GET      32.383       99.993
GET      33.279       99.993
GET      34.047       99.994
GET      34.559       99.994
GET      35.071       99.995
GET      35.327       99.995
GET      35.583       99.995
GET      35.839       99.995
GET      36.607       99.996
GET      37.375       99.996
GET      37.887       99.996
GET      38.655       99.997
GET      39.679       99.997
GET      40.703       99.997
GET      41.727       99.997
GET      42.239       99.997
GET      43.263       99.998
GET      44.031       99.998
GET      45.567       99.998
GET      48.383       99.998
GET      60.159       99.998
GET      71.679       99.998
GET      78.335       99.998
GET      85.503       99.999
GET     333.823       99.999
GET     333.823       99.999
GET     333.823       99.999
[...]
GET     708.607       99.999
GET     708.607       99.999
GET     712.703       99.999
GET     712.703       99.999
GET     712.703       99.999
[...]
GET     712.703      100.000
GET     712.703      100.000
GET     712.703      100.000
[...]
GET     876.543      100.000
GET     876.543      100.000
GET     888.831      100.000
GET     888.831      100.000
GET     888.831      100.000
[...]
GET     892.927      100.000
GET     892.927      100.000
GET     892.927      100.000
[...]
GET     905.215      100.000
GET     905.215      100.000
---
WAIT      0.000      100.000


Results for Redis on port 6379:
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1321.78          ---          ---       119.19506       117.24700       180.22300       288.76700   1353565.07 
Gets        13214.81        43.33     13171.48         3.20675         2.84700        10.43100        18.30300      5354.17 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      14536.59        43.33     13171.48        13.75327         2.99100       139.26300       178.17500   1358919.23 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.319        0.000
SET      95.743        5.000
SET     100.863       10.000
SET     103.935       15.000
SET     106.495       20.000
SET     108.543       25.000
SET     110.079       30.000
SET     112.127       35.000
SET     113.663       40.000
SET     115.711       45.000
SET     117.247       50.000
SET     118.271       52.500
SET     119.295       55.000
SET     119.807       57.500
SET     120.831       60.000
SET     121.855       62.500
SET     122.879       65.000
SET     123.903       67.500
SET     124.927       70.000
SET     126.463       72.500
SET     127.487       75.000
SET     128.511       76.250
SET     129.023       77.500
SET     130.047       78.750
SET     130.559       80.000
SET     132.095       81.250
SET     133.119       82.500
SET     134.143       83.750
SET     135.167       85.000
SET     136.191       86.250
SET     137.215       87.500
SET     138.239       88.125
SET     139.263       88.750
SET     139.263       89.375
SET     140.287       90.000
SET     141.311       90.625
SET     142.335       91.250
SET     143.359       91.875
SET     144.383       92.500
SET     146.431       93.125
SET     147.455       93.750
SET     148.479       94.062
SET     148.479       94.375
SET     149.503       94.688
SET     150.527       95.000
SET     151.551       95.312
SET     152.575       95.625
SET     153.599       95.938
SET     155.647       96.250
SET     156.671       96.562
SET     158.719       96.875
SET     159.743       97.031
SET     160.767       97.188
SET     161.791       97.344
SET     162.815       97.500
SET     163.839       97.656
SET     165.887       97.812
SET     166.911       97.969
SET     168.959       98.125
SET     169.983       98.281
SET     172.031       98.438
SET     173.055       98.516
SET     174.079       98.594
SET     175.103       98.672
SET     176.127       98.750
SET     177.151       98.828
SET     178.175       98.906
SET     180.223       98.984
SET     181.247       99.062
SET     183.295       99.141
SET     186.367       99.219
SET     187.391       99.258
SET     188.415       99.297
SET     190.463       99.336
SET     192.511       99.375
SET     194.559       99.414
SET     197.631       99.453
SET     199.679       99.492
SET     202.751       99.531
SET     206.847       99.570
SET     210.943       99.609
SET     212.991       99.629
SET     215.039       99.648
SET     218.111       99.668
SET     220.159       99.688
SET     224.255       99.707
SET     229.375       99.727
SET     233.471       99.746
SET     237.567       99.766
SET     243.711       99.785
SET     251.903       99.805
SET     254.975       99.814
SET     259.071       99.824
SET     261.119       99.834
SET     268.287       99.844
SET     270.335       99.854
SET     274.431       99.863
SET     278.527       99.873
SET     282.623       99.883
SET     286.719       99.893
SET     288.767       99.902
SET     294.911       99.907
SET     296.959       99.912
SET     301.055       99.917
SET     307.199       99.922
SET     307.199       99.927
SET     311.295       99.932
SET     313.343       99.937
SET     319.487       99.941
SET     325.631       99.946
SET     329.727       99.951
SET     333.823       99.954
SET     335.871       99.956
SET     337.919       99.958
SET     342.015       99.961
SET     344.063       99.963
SET     346.111       99.966
SET     350.207       99.968
SET     362.495       99.971
SET     368.639       99.973
SET     376.831       99.976
SET     382.975       99.977
SET     602.111       99.978
SET     602.111       99.979
SET     602.111       99.980
SET     602.111       99.982
SET     602.111       99.983
SET     602.111       99.984
SET     606.207       99.985
SET     606.207       99.987
SET     606.207       99.988
SET     606.207       99.988
SET     606.207       99.989
SET     606.207       99.990
SET     606.207       99.990
SET     606.207       99.991
SET     610.303       99.991
SET     610.303       99.992
SET     610.303       99.993
SET     610.303       99.993
SET     610.303       99.994
SET     610.303       99.994
SET     610.303       99.995
SET     614.399       99.995
SET     614.399       99.995
SET     614.399       99.995
SET     614.399       99.996
SET     614.399       99.996
SET     614.399       99.996
SET     614.399       99.997
SET     614.399       99.997
SET     614.399       99.997
[...]
SET     614.399       99.998
SET     614.399       99.998
SET     614.399       99.998
[...]
SET     618.495       99.998
SET     618.495       99.998
SET     618.495       99.999
SET     618.495       99.999
SET     618.495       99.999
[...]
SET     622.591      100.000
SET     622.591      100.000
---
GET       0.039        0.000
GET       1.471        5.000
GET       1.671       10.000
GET       1.831       15.000
GET       1.983       20.000
GET       2.143       25.000
GET       2.287       30.000
GET       2.431       35.000
GET       2.575       40.000
GET       2.719       45.000
GET       2.847       50.000
GET       2.911       52.500
GET       2.991       55.000
GET       3.055       57.500
GET       3.135       60.000
GET       3.215       62.500
GET       3.295       65.000
GET       3.391       67.500
GET       3.487       70.000
GET       3.583       72.500
GET       3.695       75.000
GET       3.759       76.250
GET       3.823       77.500
GET       3.887       78.750
GET       3.967       80.000
GET       4.047       81.250
GET       4.127       82.500
GET       4.223       83.750
GET       4.351       85.000
GET       4.447       86.250
GET       4.575       87.500
GET       4.671       88.125
GET       4.735       88.750
GET       4.831       89.375
GET       4.927       90.000
GET       5.023       90.625
GET       5.151       91.250
GET       5.279       91.875
GET       5.407       92.500
GET       5.567       93.125
GET       5.759       93.750
GET       5.855       94.062
GET       5.983       94.375
GET       6.079       94.688
GET       6.207       95.000
GET       6.367       95.312
GET       6.495       95.625
GET       6.655       95.938
GET       6.847       96.250
GET       7.039       96.562
GET       7.263       96.875
GET       7.391       97.031
GET       7.519       97.188
GET       7.679       97.344
GET       7.807       97.500
GET       7.999       97.656
GET       8.159       97.812
GET       8.383       97.969
GET       8.639       98.125
GET       8.831       98.281
GET       9.151       98.438
GET       9.279       98.516
GET       9.471       98.594
GET       9.599       98.672
GET       9.791       98.750
GET       9.983       98.828
GET      10.175       98.906
GET      10.431       98.984
GET      10.623       99.062
GET      10.943       99.141
GET      11.199       99.219
GET      11.391       99.258
GET      11.519       99.297
GET      11.711       99.336
GET      11.903       99.375
GET      12.095       99.414
GET      12.351       99.453
GET      12.543       99.492
GET      12.799       99.531
GET      13.055       99.570
GET      13.375       99.609
GET      13.503       99.629
GET      13.695       99.648
GET      13.887       99.668
GET      14.143       99.688
GET      14.399       99.707
GET      14.655       99.727
GET      14.911       99.746
GET      15.231       99.766
GET      15.487       99.785
GET      15.871       99.805
GET      15.999       99.814
GET      16.191       99.824
GET      16.383       99.834
GET      16.639       99.844
GET      16.895       99.854
GET      17.151       99.863
GET      17.407       99.873
GET      17.663       99.883
GET      18.047       99.893
GET      18.303       99.902
GET      18.559       99.907
GET      18.687       99.912
GET      18.943       99.917
GET      19.199       99.922
GET      19.455       99.927
GET      19.711       99.932
GET      19.967       99.937
GET      20.223       99.941
GET      20.479       99.946
GET      20.863       99.951
GET      21.119       99.954
GET      21.247       99.956
GET      21.503       99.958
GET      21.759       99.961
GET      22.015       99.963
GET      22.271       99.966
GET      22.783       99.968
GET      23.295       99.971
GET      24.063       99.973
GET      24.575       99.976
GET      25.087       99.977
GET      25.471       99.978
GET      25.855       99.979
GET      26.751       99.980
GET      27.775       99.982
GET      28.799       99.983
GET      29.439       99.984
GET      30.207       99.985
GET      31.487       99.987
GET      32.639       99.988
GET      33.279       99.988
GET      33.535       99.989
GET      34.559       99.990
GET      35.327       99.990
GET      36.607       99.991
GET      38.143       99.991
GET      41.471       99.992
GET      52.479       99.993
GET      55.551       99.993
GET      58.367       99.994
GET      59.903       99.994
GET      61.439       99.995
GET      62.207       99.995
GET      63.231       99.995
GET      64.255       99.995
GET      66.047       99.996
GET      66.047       99.996
GET      67.071       99.996
GET      72.703       99.997
GET      86.015       99.997
GET      89.087       99.997
GET      89.599       99.997
GET      91.647       99.997
GET      92.159       99.998
GET      96.255       99.998
GET      96.767       99.998
GET      97.279       99.998
GET      97.279       99.998
GET      98.815       99.998
GET     100.351       99.998
GET     100.351       99.999
GET     100.351       99.999
GET     100.863       99.999
GET     100.863       99.999
GET     101.375       99.999
GET     101.887       99.999
GET     103.423       99.999
GET     103.935       99.999
GET     103.935       99.999
GET     104.447       99.999
GET     104.447       99.999
GET     104.959       99.999
GET     108.031       99.999
GET     109.055       99.999
GET     109.567       99.999
GET     112.127       99.999
GET     115.199      100.000
GET     116.223      100.000
GET     122.367      100.000
GET     133.119      100.000
GET     148.479      100.000
GET     153.599      100.000
GET     173.055      100.000
GET     173.055      100.000
GET     175.103      100.000
GET     175.103      100.000
GET     522.239      100.000
GET     522.239      100.000
GET     522.239      100.000
[...]
GET     524.287      100.000
GET     524.287      100.000
---
WAIT      0.000      100.000